



Mobile Ad hoc Networks Working Group                          S. Ratliff
Internet-Draft                                                VT iDirect
Intended status: Standards Track                                B. Berry
Expires: October 15, 2015
                                                                 S. Jury
                                                           Cisco Systems
                                                          D. Satterwhite
                                                                Broadcom
                                                               R. Taylor
                                                  Airbus Defence & Space
                                                          April 13, 2015


                 Dynamic Link Exchange Protocol (DLEP)
                        draft-ietf-manet-dlep-09

Abstract

   When routing devices rely on modems to effect communications over
   wireless links, they need timely and accurate knowledge of the
   characteristics of the link (speed, state, etc.) in order to make
   forwarding decisions.  In mobile or other environments where these
   characteristics change frequently, manual configurations or the
   inference of state through routing or transport protocols does not
   allow the router to make the best decisions.  A bidirectional, event-
   driven communication channel between the router and the modem is
   necessary.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on October 15, 2015.







Ratliff, et al.         Expires October 15, 2015                [Page 1]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


Copyright Notice

   Copyright (c) 2015 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   4
     1.1.  Protocol Overview . . . . . . . . . . . . . . . . . . . .   7
     1.2.  Requirements  . . . . . . . . . . . . . . . . . . . . . .   8
   2.  Assumptions . . . . . . . . . . . . . . . . . . . . . . . . .   8
   3.  Core Features and Optional Extensions . . . . . . . . . . . .  10
     3.1.  Negotiation of Optional Extensions  . . . . . . . . . . .  10
     3.2.  Protocol Extensions . . . . . . . . . . . . . . . . . . .  10
     3.3.  Experimental Signals and Data Items . . . . . . . . . . .  11
   4.  Metrics . . . . . . . . . . . . . . . . . . . . . . . . . . .  11
     4.1.  Mandatory Metrics . . . . . . . . . . . . . . . . . . . .  12
     4.2.  DLEP Router session flow - Discovery case . . . . . . . .  12
     4.3.  DLEP Router session flow - Configured case  . . . . . . .  13
     4.4.  DLEP Modem session flow . . . . . . . . . . . . . . . . .  13
     4.5.  Common Session Flow . . . . . . . . . . . . . . . . . . .  14
   5.  DLEP Message Processing . . . . . . . . . . . . . . . . . . .  15
     5.1.  DLEP Signal Header  . . . . . . . . . . . . . . . . . . .  16
     5.2.  DLEP Generic Data Item  . . . . . . . . . . . . . . . . .  16
   6.  DLEP Signals  . . . . . . . . . . . . . . . . . . . . . . . .  17
     6.1.  Peer Discovery Signal . . . . . . . . . . . . . . . . . .  17
     6.2.  Peer Offer Signal . . . . . . . . . . . . . . . . . . . .  18
     6.3.  Peer Initialization Signal  . . . . . . . . . . . . . . .  18
     6.4.  Peer Initialization ACK Signal  . . . . . . . . . . . . .  19
     6.5.  Peer Update Signal  . . . . . . . . . . . . . . . . . . .  21
     6.6.  Peer Update ACK Signal  . . . . . . . . . . . . . . . . .  22
     6.7.  Peer Termination Signal . . . . . . . . . . . . . . . . .  23
     6.8.  Peer Termination ACK Signal . . . . . . . . . . . . . . .  24
     6.9.  Destination Up Signal . . . . . . . . . . . . . . . . . .  24
     6.10. Destination Up ACK Signal . . . . . . . . . . . . . . . .  25
     6.11. Destination Down Signal . . . . . . . . . . . . . . . . .  26
     6.12. Destination Down ACK Signal . . . . . . . . . . . . . . .  26
     6.13. Destination Update Signal . . . . . . . . . . . . . . . .  27



Ratliff, et al.         Expires October 15, 2015                [Page 2]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


     6.14. Heartbeat Signal  . . . . . . . . . . . . . . . . . . . .  28
     6.15. Link Characteristics Request Signal . . . . . . . . . . .  28
     6.16. Link Characteristics ACK Signal . . . . . . . . . . . . .  29
   7.  DLEP Data Items . . . . . . . . . . . . . . . . . . . . . . .  30
     7.1.  DLEP Version  . . . . . . . . . . . . . . . . . . . . . .  31
     7.2.  Status  . . . . . . . . . . . . . . . . . . . . . . . . .  32
     7.3.  IPv4 Connection Point . . . . . . . . . . . . . . . . . .  33
     7.4.  IPv6 Connection Point . . . . . . . . . . . . . . . . . .  34
     7.5.  Peer Type . . . . . . . . . . . . . . . . . . . . . . . .  35
     7.6.  Heartbeat Interval  . . . . . . . . . . . . . . . . . . .  35
     7.7.  Extensions Supported  . . . . . . . . . . . . . . . . . .  36
     7.8.  Experimental Definition . . . . . . . . . . . . . . . . .  36
     7.9.  MAC Address . . . . . . . . . . . . . . . . . . . . . . .  37
     7.10. IPv4 Address  . . . . . . . . . . . . . . . . . . . . . .  38
     7.11. IPv6 Address  . . . . . . . . . . . . . . . . . . . . . .  38
     7.12. IPv4 Attached Subnet  . . . . . . . . . . . . . . . . . .  39
     7.13. IPv6 Attached Subnet  . . . . . . . . . . . . . . . . . .  40
     7.14. Maximum Data Rate (Receive) . . . . . . . . . . . . . . .  40
     7.15. Maximum Data Rate (Transmit)  . . . . . . . . . . . . . .  41
     7.16. Current Data Rate (Receive) . . . . . . . . . . . . . . .  42
     7.17. Current Data Rate (Transmit)  . . . . . . . . . . . . . .  42
     7.18. Latency . . . . . . . . . . . . . . . . . . . . . . . . .  43
     7.19. Resources (Receive) . . . . . . . . . . . . . . . . . . .  44
     7.20. Resources (Transmit)  . . . . . . . . . . . . . . . . . .  45
     7.21. Relative Link Quality (Receive) . . . . . . . . . . . . .  45
     7.22. Relative Link Quality (Transmit)  . . . . . . . . . . . .  46
     7.23. Link Characteristics ACK Timer  . . . . . . . . . . . . .  46
   8.  Credit-Windowing  . . . . . . . . . . . . . . . . . . . . . .  47
     8.1.  Credit-Windowing Signals  . . . . . . . . . . . . . . . .  47
       8.1.1.  Destination Up Signal . . . . . . . . . . . . . . . .  48
       8.1.2.  Destination Up ACK Signal . . . . . . . . . . . . . .  48
       8.1.3.  Destination Update Signal . . . . . . . . . . . . . .  48
     8.2.  Credit-Windowing Data Items . . . . . . . . . . . . . . .  48
       8.2.1.  Credit Grant  . . . . . . . . . . . . . . . . . . . .  49
       8.2.2.  Credit Window Status  . . . . . . . . . . . . . . . .  50
       8.2.3.  Credit Request  . . . . . . . . . . . . . . . . . . .  50
   9.  Security Considerations . . . . . . . . . . . . . . . . . . .  51
   10. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  51
     10.1.  Registrations  . . . . . . . . . . . . . . . . . . . . .  51
     10.2.  Expert Review: Evaluation Guidelines . . . . . . . . . .  52
     10.3.  Signal Type Registration . . . . . . . . . . . . . . . .  52
     10.4.  DLEP Data Item Registrations . . . . . . . . . . . . . .  53
     10.5.  DLEP Status Code Registrations . . . . . . . . . . . . .  54
     10.6.  DLEP Extensions Registrations  . . . . . . . . . . . . .  54
     10.7.  DLEP Well-known Port . . . . . . . . . . . . . . . . . .  55
     10.8.  DLEP Multicast Address . . . . . . . . . . . . . . . . .  55
   11. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  55
   12. References  . . . . . . . . . . . . . . . . . . . . . . . . .  55



Ratliff, et al.         Expires October 15, 2015                [Page 3]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


     12.1.  Normative References . . . . . . . . . . . . . . . . . .  55
     12.2.  Informative References . . . . . . . . . . . . . . . . .  55
   Appendix A.  Peer Level Signal Flows  . . . . . . . . . . . . . .  55
     A.1.  Discovery . . . . . . . . . . . . . . . . . . . . . . . .  55
     A.2.  Session Initialization  . . . . . . . . . . . . . . . . .  56
     A.3.  Session Initialization - Refused  . . . . . . . . . . . .  57
     A.4.  Router Changes IP Addresses . . . . . . . . . . . . . . .  57
     A.5.  Modem Changes Session-wide Metrics  . . . . . . . . . . .  57
     A.6.  Router Terminates Session . . . . . . . . . . . . . . . .  58
     A.7.  Modem Terminates Session  . . . . . . . . . . . . . . . .  58
     A.8.  Session Heartbeats  . . . . . . . . . . . . . . . . . . .  59
     A.9.  Router Detects a Heartbeat timeout  . . . . . . . . . . .  60
     A.10. Modem Detects a Heartbeat timeout . . . . . . . . . . . .  61
   Appendix B.  Destination Specific Signal Flows  . . . . . . . . .  61
     B.1.  Common Destination Signaling  . . . . . . . . . . . . . .  61
     B.2.  Multicast Destination Signaling . . . . . . . . . . . . .  62
     B.3.  Link Characteristics Request  . . . . . . . . . . . . . .  62
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  63

1.  Introduction

   There exist today a collection of modem devices that control links of
   variable datarate and quality.  Examples of these types of links
   include line-of-sight (LOS) terrestrial radios, satellite terminals,
   and cable/DSL modems.  Fluctuations in speed and quality of these
   links can occur due to configuration (in the case of cable/DSL
   modems), or on a moment-to-moment basis, due to physical phenomena
   like multipath interference, obstructions, rain fade, etc.  It is
   also quite possible that link quality and datarate varies with
   respect to individual destinations on a link, and with the type of
   traffic being sent.  As an example, consider the case of an 802.11g
   access point, serving 2 associated laptop computers.  In this
   environment, the answer to the question "What is the datarate on the
   802.11g link?" is "It depends on which associated laptop we're
   talking about, and on what kind of traffic is being sent."  While the
   first laptop, being physically close to the access point, may have a
   datarate of 54Mbps for unicast traffic, the other laptop, being
   relatively far away, or obstructed by some object, can simultaneously
   have a datarate of only 32Mbps for unicast.  However, for multicast
   traffic sent from the access point, all traffic is sent at the base
   transmission rate (which is configurable, but depending on the model
   of the access point, is usually 24Mbps or less).

   In addition to utilizing variable datarate links, mobile networks are
   challenged by the notion that link connectivity will come and go over
   time, without an effect on a router's interface state (Up or Down).
   Effectively utilizing a relatively short-lived connection is
   problematic in IP routed networks, as routing protocols tend to rely



Ratliff, et al.         Expires October 15, 2015                [Page 4]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   on interface state and independent timers at OSI Layer 3 to maintain
   network convergence (e.g., HELLO messages and/or recognition of DEAD
   routing adjacencies).  These dynamic connections can be better
   utilized with an event-driven paradigm, where acquisition of a new
   neighbor (or loss of an existing one) is signaled, as opposed to a
   paradigm driven by timers and/or interface state.

   Another complicating factor for mobile networks are the different
   methods of physically connecting the modem devices to the router.
   Modems can be deployed as an interface card in a router's chassis, or
   as a standalone device connected to the router via Ethernet or serial
   link.  In the case of Ethernet or serial attachment, with existing
   protocols and techniques, routing software cannot be aware of
   convergence events occurring on the radio link (e.g., acquisition or
   loss of a potential routing neighbor), nor can the router be aware of
   the actual capacity of the link.  This lack of awareness, along with
   the variability in datarate, leads to a situation where finding the
   (current) best route through the network to a given destination is
   difficult to establish and properly maintain.  This is especially
   true of demand-based access schemes such as Demand Assigned Multiple
   Access (DAMA) implementations used on some satellite systems.  With a
   DAMA-based system, additional datarate may be available, but will not
   be used unless the network devices emit traffic at a rate higher than
   the currently established rate.  Increasing the traffic rate does not
   guarantee additional datarate will be allocated; rather, it may
   result in data loss and additional retransmissions on the link.

   Addressing the challenges listed above, the authors have developed
   the Dynamic Link Exchange Protocol, or DLEP.  The DLEP protocol runs
   between a router and its attached modem devices, allowing the modem
   to communicate link characteristics as they change, and convergence
   events (acquisition and loss of potential routing destinations).  The
   following diagrams are used to illustrate the scope of DLEP packets.

      |-------Local Node-------|          |-------Remote Node------|
      |                        |          |                        |
      +--------+       +-------+          +-------+       +--------+
      | Router |=======| Modem |{~~~~~~~~}| Modem |=======| Router |
      |        |       | Device|          | Device|       |        |
      +--------+       +-------+          +-------+       +--------+
               |       |       | Link     |       |       |
               |-DLEP--|       | Protocol |       |-DLEP--|
               |       |       | (e.g.    |       |       |
               |       |       | 802.11)  |       |       |

                          Figure 1: DLEP Network





Ratliff, et al.         Expires October 15, 2015                [Page 5]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   In Figure 1, when the local modem detects the presence of a remote
   node, it (the local modem) sends a signal to its router via the DLEP
   protocol.  Upon receipt of the signal, the local router may take
   whatever action it deems appropriate, such as initiating discovery
   protocols, and/or issuing HELLO messages to converge the network.  On
   a continuing, as-needed basis, the modem devices utilize DLEP to
   report any characteristics of the link (datarate, latency, etc.) that
   have changed.  DLEP is independent of the link type and topology
   supported by the modem.  Note that the DLEP protocol is specified to
   run only on the local link between router and modem.  Some over the
   air signaling may be necessary between the local and remote modem in
   order to provide some parameters in DLEP signals between the local
   modem and local router, but DLEP does not specify how such over the
   air signaling is carried out.  Over the air signaling is purely a
   matter for the modem implementer.

   Figure 2 shows how DLEP can support a configuration where routers are
   connected with different link types.  In this example, Modem A
   implements a point-to-point link, and Modem B is connected via a
   shared medium.  In both cases, the DLEP protocol is used to report
   the characteristics of the link (datarate, latency, etc.) to routers.
   The modem is also able to use the DLEP session to notify the router
   when the remote node is lost, shortening the time required to re-
   converge the network.



























Ratliff, et al.         Expires October 15, 2015                [Page 6]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


                 +--------+                     +--------+
            +----+ Modem A|                     | Modem A+---+
            |    | Device |  <===== // ======>  | Device |   |
            |    +--------+      P-2-P Link     +--------+   |
        +---+----+                                       +---+----+
        | Router |                                       | Router |
        |        |                                       |        |
        +---+----+                                       +---+----+
            |     +--------+                     +--------+  |
            +-----+ Modem B|                     | Modem B|  |
                  | Device |   o o o o o o o o   | Device +--+
                  +--------+    o  Shared   o    +--------+
                                 o Medium  o
                                  o       o
                                   o     o
                                    o   o
                                      o
                                 +--------+
                                 | Modem B|
                                 | Device |
                                 +---+----+
                                     |
                                     |
                                 +---+----+
                                 | Router |
                                 |        |
                                 +--------+

            Figure 2: DLEP Network with Multiple Modem Devices

1.1.  Protocol Overview

   DLEP defines a set of signals used by modems and their attached
   routers.  The signals are used to communicate events that occur on
   the physical link(s) managed by the modem: for example, a remote node
   entering or leaving the network, or that the link has changed.
   Associated with these signals are a set of data items - information
   that describes the remote node (e.g., address information), and/or
   the characteristics of the link to the remote node.

   The protocol is defined as a collection of type-length-value (TLV)
   based formats, specifying the signals that are exchanged between a
   router and a modem, and the data items associated with the signal.
   This document specifies transport of DLEP signals and data items via
   the TCP transport, with a UDP-based discovery mechanism.  Other
   transports for the protocol are possible, but are outside the scope
   of this document.




Ratliff, et al.         Expires October 15, 2015                [Page 7]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   DLEP uses a session-oriented paradigm between the modem device and
   its associated router.  If multiple modem devices are attached to a
   router (as in Figure 2), or the modem supports multiple connections
   (via multiple logical or physical interfaces), then separate DLEP
   sessions exist for each modem or connection.  This router/modem
   session provides a carrier for information exchange concerning
   'destinations' that are available via the modem device.  A
   'destination' can be either physical (as in the case of a specific
   far-end router), or a logical destination (as in a Multicast group).
   As such, all of the destination-level exchanges in DLEP can be
   envisioned as building an information base concerning the remote
   nodes, and the link characteristics to those nodes.

   Multicast traffic destined for the variable-quality network (the
   network accessed via the DLEP modem) is handled in IP networks by
   deriving a Layer 2 MAC address based on the Layer 3 address.
   Leveraging on this scheme, multicast traffic is supported in DLEP
   simply by treating the derived MAC address as any other 'destination'
   (albeit a logical one) in the network.  To support these logical
   destinations, one of the DLEP participants (typically, the router)
   informs the other as to the existence of the logical destination.
   The modem, once it is aware of the existence of this logical
   destination, reports link characteristics just as it would for any
   other destination in the network.  The specific algorithms a modem
   would use to derive metrics on multicast (or logical) destinations is
   outside the scope of this specification, and is left to specific
   implementations to decide.

1.2.  Requirements

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in BCP 14, RFC 2119
   [RFC2119].

2.  Assumptions

   Routers and modems that exist as part of the same node (e.g., that
   are locally connected) can utilize a discovery technique to locate
   each other, thus avoiding a-priori configuration.  The router is
   responsible for initializing the discovery process, using the Peer
   Discovery signal (Section 6.1).

   DLEP utilizes a session-oriented paradigm.  A router and modem form a
   session by completing the discovery and initialization process.  This
   router-modem session persists unless or until it either (1) times
   out, based on the timeout values supplied, or (2) is explicitly torn
   down by one of the participants.  Note that while use of timers in



Ratliff, et al.         Expires October 15, 2015                [Page 8]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   DLEP is OPTIONAL, it is strongly recommended that implementations
   choose to run with timers enabled.

   DLEP assumes that the MAC address for delivering data traffic is the
   MAC specified in the Destination Up signal (Section 6.9).  No
   manipulation or substitution is performed; the MAC address supplied
   in Destination Up is used as the OSI Layer 2 Destination MAC address.
   DLEP also assumes that MAC addresses MUST be unique within the
   context of a router-modem session.

   DLEP utilizes UDP multicast for single-hop discovery, and TCP for
   transport of the control signals.  Therefore, DLEP assumes that the
   modem and router have topologically consistent IP addresses assigned.
   It is recommended that DLEP implementations utilize IPv6 link-local
   addresses to reduce the administrative burden of address assignment.

   Destinations can be identified by either the router or the modem, and
   represent a specific destination (e.g., an address) that exists on
   the link(s) managed by the modem.  A destination MUST contain a MAC
   address, it MAY optionally include a Layer 3 address (or addresses).
   Note that since a destination is a MAC address, the MAC could
   reference a logical destination, as in a derived multicast MAC
   address, as well as a physical device.  As destinations are
   discovered, DLEP routers and modems build an information base on
   destinations accessible via the modem.

   The DLEP signals concerning destinations thus become the way for
   routers and modems to maintain, and notify each other about, an
   information base representing the physical and logical (e.g.,
   multicast) destinations accessible via the modem device.  The
   information base would contain addressing information (i.e.  MAC
   address, and OPTIONALLY, Layer 3 addresses), link characteristics
   (metrics), and OPTIONALLY, flow control information (credits).

   DLEP assumes that any signal not understood by a receiver MUST result
   in an error indication being sent to the originator, and also MUST
   result in termination of the session between the DLEP peers.  Any
   data item that is not understood by a receiver MUST be ignored.

   DLEP assumes that security on the session (e.g., authentication of
   session partners, encryption of traffic, or both) is dealt with by
   the underlying transport mechanism (e.g., by using a transport such
   as TLS [RFC5246]).

   This document specifies an implementation of the DLEP signals and
   data items running over the TCP transport.  It is assumed that DLEP
   running over other transport mechanisms would be documented
   separately.



Ratliff, et al.         Expires October 15, 2015                [Page 9]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


3.  Core Features and Optional Extensions

   DLEP has a core set of signals and data items that MUST be processed
   without error by an implementation in order to guarantee
   interoperability and therefore make the implementation DLEP
   compliant.  This document defines the core set of signals and data
   items, listing them as 'mandatory'.  It should be noted that some
   core signals and data items might not be used during the lifetime of
   a single DLEP session, but a compliant implementation MUST support
   them.

   While this document represents the best efforts of the co-authors,
   and the working group, to be functionally complete, it is recognized
   that extensions to DLEP will in all likelihood be necessary as more
   link types are utilized.  To support future extension of DLEP, this
   document describes an extension negotiation capability to be used
   during session initialization via the Extensions Supported data item,
   documented in Section 7.7 of this document.

   All extensions are considered OPTIONAL.  Only the DLEP functionality
   listed as 'mandatory' is required by implementation in order to be
   DLEP compliant.

   This specification defines one extension, Credit windowing, exposed
   via the Extensions Supported mechanism that implementations MAY
   choose to implement, or to omit.

3.1.  Negotiation of Optional Extensions

   Optional extensions supported by an implementation MUST be declared
   to potential DLEP peers using the Extensions Supported data item
   (Section 7.7) during the session initialization sequence.  Once both
   peers have exchanged initialization signals, an implementation MUST
   NOT emit any signal or data item associated with an optional
   extension that was not specified in the received initialization
   signal from its peer.

3.2.  Protocol Extensions

   If/when protocol extensions are required, they should be standardized
   either as an update to this document, or as an additional stand-alone
   specification.  The requests for IANA-controlled registries in this
   document contain sufficient reserved space, both in terms of DLEP
   signals and DLEP data items, to accommodate future extensions to the
   protocol and the data transferred.






Ratliff, et al.         Expires October 15, 2015               [Page 10]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


3.3.  Experimental Signals and Data Items

   This document requests numbering space in both the DLEP signal and
   data item registries for experimental items.  The intent is to allow
   for experimentation with new signals and/or data items, while still
   retaining the documented DLEP behavior.  If a given experiment proves
   successful, it SHOULD be documented as an update to this document, or
   as a stand-alone specification.

   Use of the experimental signals, data items, or behaviors MUST be
   announced by inclusion of an Experimental Definition data item
   (Section 7.8) with a value agreed upon (a-priori) between the
   participating peers.  The exact mechanism for a-priori communication
   of the experimental definition formats is beyond the scope of this
   document.

   Multiple Experimental Definition data items MAY appear in the Peer
   Initialization/Peer Initialization ACK sequence.  However, use of
   multiple experiments in a single peer session could lead to
   interoperability issues or unexpected results (e.g., redefinition of
   experimental signals and/or data items), and is therefore
   discouraged.  It is left to implementations to determine the correct
   processing path (e.g., a decision on whether to terminate the peer
   session, or to establish a precedence of the conflicting definitions)
   if such conflicts arise.

4.  Metrics

   DLEP includes the ability for the router and modem to communicate
   metrics that reflect the characteristics (e.g., datarate, latency) of
   the variable-quality link in use.  DLEP does NOT specify how a given
   metric value is to be calculated, rather, the protocol assumes that
   metrics have been calculated with a 'best effort', incorporating all
   pertinent data that is available to the modem device.

   As mentioned in the introduction section of this document, DLEP
   allows for metrics to be sent within two contexts - metrics for a
   specific destination within the network (e.g., a specific router),
   and 'modem-wide' (those that apply to all destinations accessed via
   the modem).  Most metrics can be further subdivided into transmit and
   receive metrics.  Metrics supplied on DLEP Peer signals are, by
   definition, modem-wide; metrics supplied on Destination signals are,
   by definition, used for the specific logical destination only.

   DLEP modem implementations MUST announce all supported metric items,
   and provide default values for those metrics, in the Peer
   Initialization ACK signal (Section 6.4).  In order to introduce a new
   metric type, DLEP modem implementations MUST terminate the session



Ratliff, et al.         Expires October 15, 2015               [Page 11]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   with the router (via the Peer Terminate signal (Section 6.7)), and
   re-establish the session.

   It is left to implementations to choose sensible default values based
   on their specific characteristics.  Modems having static (non-
   changing) link metric characteristics MAY report metrics only once
   for a given destination (or once on a modem-wide basis, if all
   connections via the modem are of this static nature).

   The approach of allowing for different contexts for metric data
   increases both the flexibility and the complexity of using metric
   data.  This document details the mechanism whereby the data is
   transmitted, however, the specific algorithms (precedence, etc.) for
   utilizing the dual-context metrics is out of scope and not addressed
   by this document.

4.1.  Mandatory Metrics

   As mentioned above, DLEP modem implementations MUST announce all
   supported metric items during session initialization.  However, an
   implementation MUST include the following list of metrics:

   o  Maximum Data Rate (Receive) (Section 7.14)

   o  Maximum Data Rate (Transmit) (Section 7.15)

   o  Current Data Rate (Receive) (Section 7.16)

   o  Current Data Rate (Transmit) (Section 7.17)

   o  Latency (Section 7.18)

4.2.  DLEP Router session flow - Discovery case

   If the DLEP router implementation is utilizing the optional discovery
   mechanism, then the implementation will initialize a UDP socket,
   binding it to an arbitrary port.  This UDP socket is used to send the
   Peer Discovery signal (Section 6.1) to the DLEP link-local multicast
   address and port (TBD).  The implementation then waits on receipt of
   a Peer Offer signal (Section 6.2), which MAY contain the unicast
   address and port for TCP-based communication with a DLEP modem, via
   the IPv4 Connection Point data item (Section 7.3) or the IPv6
   Connection Point data item (Section 7.4).  The Peer Offer signal MAY
   contain multiple IP Connection Point data items.  If more than one IP
   Connection Point data items is in the Peer Offer, router
   implementations MAY use their own heuristics to determine the best
   address/port combination.  If no IP Connection Point data items are
   included in the Peer Offer signal, the receiver MUST use the origin



Ratliff, et al.         Expires October 15, 2015               [Page 12]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   address of the signal as the IP address, and the DLEP well-known port
   number (Section 10.7) to establish the TCP connection.  At this
   point, the router implementation MAY either destroy the UDP socket,
   or continue to issue Peer Discovery signals to the link-local
   address/port combination.  In either case, the TCP session
   initialization occurs as in the configured case.

4.3.  DLEP Router session flow - Configured case

   When a DLEP router implementation has the address and port
   information for a TCP connection to a modem (obtained either via
   configuration or via the discovery process described above), the
   router will initialize and bind a TCP socket.  This socket is used to
   connect to the DLEP modem software.  After a successful TCP connect,
   the router implementation MUST issue a Peer Initialization signal
   (Section 6.3) to the DLEP modem.  After sending the Peer
   Initialization, the router implementation MUST wait for receipt of a
   Peer Initialization ACK signal (Section 6.4) from the modem.  Receipt
   of the Peer Initialization ACK signal containing a Status data item
   (Section 7.2) with value 'Success', indicates that the modem has
   received and processed the Peer Initialization, and the session MUST
   transition to the 'in session' state.  At this point, signals
   regarding destinations in the network, and/or Peer Update signals
   (Section 6.5), can flow on the DLEP session between modem and router,
   and Heartbeat signals can begin to flow, if Heartbeats are used.  The
   'in session' state is maintained until one of the following
   conditions occur:

   o  The session is explicitly terminated (using Peer Termination), or

   o  The session times out, based on supplied timeout values.

4.4.  DLEP Modem session flow

   DLEP modem implementations MUST support the discovery mechanism.
   Therefore, the normal flow is as follows:

   The implementation will initialize a UDP socket, binding that socket
   to the DLEP link-local multicast address (TBD) and the DLEP well-
   known port number (also TBD).  The implementation will then
   initialize a TCP socket, on a unicast address and port.  This socket
   is used to listen for incoming TCP connection requests.

   When the modem implementation receives a Peer Discovery signal
   (Section 6.1) on the UDP socket, it responds by issuing a Peer Offer
   signal (Section 6.2) to the sender of the Peer Discovery signal.  The
   Peer Offer signal MAY contain the unicast address and port of the
   listening TCP socket, as described above.  A DLEP modem



Ratliff, et al.         Expires October 15, 2015               [Page 13]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   implementation MAY respond with ALL address/port combinations that
   have an active TCP listen posted.  Anything other than Peer Discovery
   signals received on the UDP socket MUST be silently dropped.

   When the DLEP modem implementation accepts a connection via TCP, it
   MUST wait for receipt of a Peer Initialization signal (Section 6.3),
   sent by the router.  Upon receipt and successful parsing of a Peer
   Initialization signal, the modem MUST respond with a Peer
   Initialization ACK signal (Section 6.4).  The Peer Initialization ACK
   signal MUST contain metric data items for ALL supported metrics.  If
   an additional metric is to be introduced, the DLEP session between
   router and modem MUST be terminated and restarted, and the new metric
   described in a Peer Initialization ACK signal.  Once the Peer
   Initialization signal (Section 6.3) and Peer Initialization ACK
   signal (Section 6.4) have been exchanged, the session is transitioned
   to the 'in session' state.  As in the router case, when the 'in
   session' state is reached, signals regarding destinations in the
   network, and/or Peer Update signals (Section 6.5), can flow on the
   DLEP session between modem and router, and Heartbeat signals can
   begin to flow, if Heartbeats are used.  The 'in session' state
   persists until the session is explicitly terminated (using Peer
   Termination), or it times out (based on timeout values).

4.5.  Common Session Flow

   In order to maintain the session between router and modem, periodic
   Heartbeat signals (Section 6.14) MAY be exchanged.  These signals are
   intended to keep the session alive, and to verify bidirectional
   connectivity between the two participants.  If [Heartbeat
   signals]#(sig_heartbeat) are exchanged, they do not begin until the
   DLEP peer session has entered the 'in session' state.  Each DLEP peer
   is responsible for the creation of Heartbeat signals (Section 6.14).
   Receipt of any DLEP signal SHOULD reset the heartbeat interval timer
   (e.g., valid DLEP signals take the place of, and obviate the need
   for, Heartbeat signals).

   DLEP also provides a Peer Update signal (Section 6.5), intended to
   communicate some change in status (e.g., a change of layer 3 address
   parameters, or a modem-wide link change).

   In addition to the local (Peer level) signals above, the participants
   will transmit DLEP signals concerning destinations in the network.
   These signals trigger creation/maintenance/deletion of destinations
   in the information base of the recipient.  For example, a modem will
   inform its attached router of the presence of a new destination via
   the Destination Up signal (Section 6.9).  Receipt of a Destination Up
   causes the router to allocate the necessary resources, creating an
   entry in the information base with the specifics (i.e.  MAC Address,



Ratliff, et al.         Expires October 15, 2015               [Page 14]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   Latency, Data Rate, etc.) of the destination.  The loss of a
   destination is communicated via the Destination Down signal
   (Section 6.11), and changes in status to the destination (e.g.,
   varying link quality, or addressing changes) are communicated via the
   Destination Update signal (Section 6.13).  The information on a given
   destination will persist in the router's information base until (1) a
   Destination Down signal is received, indicating that the modem has
   lost contact with the remote node, or (2) the router/modem session
   terminates, indicating that the router has lost contact with its own
   local modem.

   Metrics can be expressed within the context of a specific destination
   via the Destination Update signal, or on a modem-wide basis via the
   Peer Update signal.  In cases where metrics are provided at peer
   level, the receiver MUST propagate the metrics to all destinations in
   its information base that are accessed via the originator.  A DLEP
   participant MAY send metrics both in a router/modem session context
   (via the Peer Update signal) and a specific destination context (via
   Destination Update) at any time.  The heuristics for applying
   received metrics is left to implementations.

   In addition to receiving metrics about the link, DLEP provides a
   signal allowing a router to request a different datarate, or latency,
   from the modem.  This signal is referred to as the Link
   Characteristics Request signal (Section 6.15), and gives the router
   the ability to deal with requisite increases (or decreases) of
   allocated datarate/latency in demand-based schemes in a more
   deterministic manner.

5.  DLEP Message Processing

   Communication between DLEP peers consists of a bidirectional stream
   of signals, each signal consisting of a signal header and an
   unordered list of data items.  Both signal headers and data items are
   encoded as TLV (Type-Length-Value) structures.  In this document, the
   data items following the signal header are described as being
   'contained in' the signal.

   All integer values in all TLV structures MUST be in network byte-
   order.

   There is no restriction on the order of data items following a
   signal, and the multiplicity of duplicate data items is defined by
   the definition of the signal declared by the type in the signal
   header.

   If an unrecognized, or unexpected signal is received, or a received
   signal contains unrecognized, invalid or disallowed duplicate data



Ratliff, et al.         Expires October 15, 2015               [Page 15]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   items, the receiving peer MUST terminate the session by issuing a
   Peer Termination signal (Section 6.7) with a Status data item
   (Section 7.2) containing the most relevant status code, and then
   close the TCP connection.

5.1.  DLEP Signal Header

   The DLEP signal header contains the following fields:

              0                   1                   2
              0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
             +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
             | Signal Type   | Length                        |
             +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                       Figure 3: DLEP Signal Header

   Signal Type:  One of the DLEP Signal Type values defined in this
      document.

   Length:  The length, expressed as a 16-bit unsigned integer, of all
      of the DLEP data items associated with this signal.  This length
      does not include the length of the header itself

   The DLEP Signal Header is immediately followed bu one or more DLEP
   data items, encoded in TLVs, as defined in this document.

5.2.  DLEP Generic Data Item

   All DLEP data items contain the following fields:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Data Item Type| Length        | Value...                      |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                     Figure 4: DLEP Generic Data Item

   Data Item Type:  An 8-bit unsigned integer field specifying the data
      item being sent.

   Length:  The length, expressed as an 8-bit unsigned integer, of the
      value field of the data item.

   Value:  A field of length <Length> which contains data specific to a
      particular data item.




Ratliff, et al.         Expires October 15, 2015               [Page 16]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


6.  DLEP Signals

   As mentioned above, all DLEP signals begin with the DLEP signal
   header structure.  Therefore, in the following descriptions of
   specific signals, this header structure is assumed, and will not be
   replicated.

   Following is the set of MANDATORY signals that must be recognized by
   a DLEP compliant implementation.  As mentioned before, not all
   signals may be used during a session, but an implementation MUST
   correctly process these signals when received.

   The mandatory DLEP signals are:

        +---------+-------------------------------+---------------+
        | Signal  | Description                   | Section       |
        +---------+-------------------------------+---------------+
        | TBD     | Peer Discovery                | Section 6.1   |
        | TBD     | Peer Offer                    | Section 6.2   |
        | TBD     | Peer Initialization           | Section 6.3   |
        | TBD     | Peer Initialization ACK       | Section 6.4   |
        | TBD     | Peer Update                   | Section 6.5   |
        | TBD     | Peer Update ACK               | Section 6.6   |
        | TBD     | Peer Termination              | Section 6.7   |
        | TBD     | Peer Termination ACK          | Section 6.8   |
        | TBD     | Destination Up                | Section 6.9   |
        | TBD     | Destination Up ACK            | Section 6.10  |
        | TBD     | Destination Down              | Section 6.11  |
        | TBD     | Destination Down ACK          | Section 6.12  |
        | TBD     | Destination Update            | Section 6.13  |
        | TBD     | Heartbeat                     | Section 6.14  |
        | TBD     | Link Characteristics Request  | Section 6.15  |
        | TBD     | Link Characteristics ACK      | Section 6.16  |
        +---------+-------------------------------+---------------+

6.1.  Peer Discovery Signal

   A Peer Discovery signal SHOULD be sent by a router to discover DLEP
   modems in the network.  The Peer Offer signal (Section 6.2) is
   required to complete the discovery process.  Implementations MAY
   implement their own retry heuristics in cases where it is determined
   the Peer Discovery signal has timed out.

   To construct a Peer Discovery signal, the Signal Type value in the
   signal header is set to DLEP_PEER_DISCOVERY (value TBD).

   The Peer Discovery signal MUST contain the following data item:




Ratliff, et al.         Expires October 15, 2015               [Page 17]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   o  DLEP Version (Section 7.1)

   The Peer Discovery signal MAY contain the following data item:

   o  Peer Type (Section 7.5)

6.2.  Peer Offer Signal

   A Peer Offer signal MUST be sent by a DLEP modem in response to a
   valid Peer Discovery signal (Section 6.1).

   The Peer Offer signal MUST be sent to the unicast address of the
   originator of the Peer Discovery signal.

   To construct a Peer Offer signal, the Signal Type value in the signal
   header is set to DLEP_PEER_OFFER (value TBD).

   The Peer Offer signal MUST contain the following data item:

   o  DLEP Version (Section 7.1)

   The Peer Offer signal MAY contain the following data item:

   o  Peer Type (Section 7.5)

   The Peer Offer signal MAY contain one or more of any of the following
   data items, with different values:

   o  IPv4 Connection Point (Section 7.3)

   o  IPv6 Connection Point (Section 7.4)

   The IP Connection Point data items indicate the unicast address the
   receiver of Peer Offer MUST use when connecting the DLEP TCP session.
   If multiple IP Connection Point data items are present in the Peer
   Offer signal, implementations MAY use their own heuristics to select
   the address to connect to.  If no IP Connection Point data items are
   included in the Peer Offer signal, the receiver MUST use the origin
   address of the signal as the IP address, and the DLEP well-known port
   number (Section 10.7) to establish the TCP connection.

6.3.  Peer Initialization Signal

   A Peer Initialization signal MUST be sent by a router as the first
   signal of the DLEP TCP session.  It is sent by the router after a TCP
   connect to an address/port combination that was obtained either via
   receipt of a Peer Offer, or from a-priori configuration.




Ratliff, et al.         Expires October 15, 2015               [Page 18]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   If any optional extensions are supported by the implementation, they
   MUST be enumerated in the Extensions Supported data item.  If an
   Extensions Supported data item does NOT exist in a Peer
   Initialization signal, the receiver of the signal MUST conclude that
   there is NO support for extensions in the sender.

   If any experimental signals or data items are used by the
   implementation, they MUST be enumerated in one or more Experimental
   Definition data items.  If there are no Experimental Definition data
   items in a Peer Initialization signal, the receiver of the signal
   MUST conclude that NO experimental definitions are in use by the
   sender.

   To construct a Peer Initialization signal, the Signal Type value in
   the signal header is set to DLEP_PEER_INITIALIZATION (value TBD).

   The Peer Initialization signal MUST contain one of each of the
   following data items:

   o  DLEP Version (Section 7.1)

   o  Heartbeat Interval (Section 7.6)

   The Peer Initialization signal MAY contain one of each of the
   following data items:

   o  Peer Type (Section 7.5)

   o  Extensions Supported (Section 7.7)

   The Peer Initialization signal MAY contain one or more of any of the
   following data items, with different values:

   o  Experimental Definition (Section 7.8)

   A Peer Initialization signal MUST be acknowledged by the receiver
   issuing a Peer Initialization ACK signal (Section 6.4).

6.4.  Peer Initialization ACK Signal

   A Peer Initialization ACK signal MUST be sent in response to a
   received Peer Initialization signal (Section 6.3).  The Peer
   Initialization ACK signal completes the DLEP session establishment;
   the sender of the signal should transition to an 'in- session' state
   when the signal is sent, and the receiver should transition to the
   'in-session' state upon receipt (and successful parsing) of an
   acceptable Peer Initialization ACK signal.




Ratliff, et al.         Expires October 15, 2015               [Page 19]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   All supported metric data items MUST be included in the Peer
   Initialization ACK signal, with default values to be used on a
   'modem-wide' basis.  This can be viewed as the modem 'declaring' all
   supported metrics at DLEP session initialization.  Receipt of any
   DLEP signal containing a metric data item NOT included in the Peer
   Initialization ACK signal MUST be treated as an error, resulting in
   the termination of the DLEP session between router and modem.

   If any optional extensions are supported by the modem, they MUST be
   enumerated in the Extensions Supported data item.  If an Extensions
   Supported data item does NOT exist in a Peer Initialization ACK
   signal, the receiver of the signal MUST conclude that there is NO
   support for extensions in the sender.

   If any experimental signals or data items are used by the
   implementation, they MUST be enumerated in one or more Experimental
   Definition data items.  If there are no Experimental Definition data
   items in a Peer Initialization ACK signal, the receiver of the signal
   MUST conclude that NO experimental definitions are in use by the
   sender.

   After the Peer Initialization/Peer Initialization ACK signals have
   been successfully exchanged, implementations MUST only utilize
   extensions and experimental definitions that are supported by BOTH
   peers.

   To construct a Peer Initialization ACK signal, the Signal Type value
   in the signal header is set to DLEP_PEER_INIT_ACK (value TBD).

   The Peer Initialization ACK signal MUST contain one of each of the
   following data items:

   o  DLEP Version (Section 7.1)

   o  Heartbeat Interval (Section 7.6)

   o  Maximum Data Rate (Receive) (Section 7.14)

   o  Maximum Data Rate (Transmit) (Section 7.15)

   o  Current Data Rate (Receive) (Section 7.16)

   o  Current Data Rate (Transmit) (Section 7.17)

   o  Latency (Section 7.18)






Ratliff, et al.         Expires October 15, 2015               [Page 20]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   The Peer Initialization ACK signal MUST contain one of each of the
   following data items, if the data item will be used during the
   lifetime of the session:

   o  Resources (Receive) (Section 7.19)

   o  Resources (Transmit) (Section 7.20)

   o  Relative Link Quality (Receive) (Section 7.21)

   o  Relative Link Quality (Transmit) (Section 7.22)

   The Peer Initialization ACK signal MAY contain one of each of the
   following data items:

   o  Status (Section 7.2)

   o  Peer Type (Section 7.5)

   o  Extensions Supported (Section 7.7)

   The Peer Initialization ACK signal MAY contain one or more of any of
   the following data items, with different values:

   o  Experimental Definition (Section 7.8)

6.5.  Peer Update Signal

   A Peer Update signal MAY be sent by a DLEP peer to indicate local
   Layer 3 address changes, or metric changes on a modem-wide basis.
   For example, addition of an IPv4 address to the router MAY prompt a
   Peer Update signal to its attached DLEP modems.  Also, for example, a
   modem that changes its Maximum Data Rate (Receive) for all
   destinations MAY reflect that change via a Peer Update signal to its
   attached router(s).

   Concerning Layer 3 addresses, if the modem is capable of
   understanding and forwarding this information (via proprietary
   mechanisms), the address update would prompt any remote DLEP modems
   (DLEP-enabled modems in a remote node) to issue a Destination Update
   signal (Section 6.13) to their local routers with the new (or
   deleted) addresses.  Modems that do not track Layer 3 addresses
   SHOULD silently parse and ignore the Peer Update signal.  Modems that
   track Layer 3 addresses MUST acknowledge the Peer Update with a Peer
   Update ACK signal (Section 6.6).

   If metrics are supplied with the Peer Update signal (e.g., Maximum
   Data Rate), these metrics are considered to be modem-wide, and



Ratliff, et al.         Expires October 15, 2015               [Page 21]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   therefore MUST be applied to all destinations in the information base
   associated with the router/modem session.

   Supporting implementations are free to employ heuristics to
   retransmit Peer Update signals.  The sending of Peer Update signals
   for Layer 3 address changes SHOULD cease when either participant
   (router or modem) determines that the other implementation does NOT
   support Layer 3 address tracking.

   To construct a Peer Update signal, the Signal Type value in the
   signal header is set to DLEP_PEER_UPDATE (value TBD).

   The Peer Update signal MAY contain one of each of the following data
   items:

   o  Maximum Data Rate (Receive) (Section 7.14)

   o  Maximum Data Rate (Transmit) (Section 7.15)

   o  Current Data Rate (Receive) (Section 7.16)

   o  Current Data Rate (Transmit) (Section 7.17)

   o  Latency (Section 7.18)

   o  Resources (Receive) (Section 7.19)

   o  Resources (Transmit) (Section 7.20)

   o  Relative Link Quality (Receive) (Section 7.21)

   o  Relative Link Quality (Transmit) (Section 7.22)

   The Peer Update signal MAY contain one or more of the following data
   items, with different values:

   o  IPv4 Address (Section 7.10)

   o  IPv6 Address (Section 7.11)

   A Peer Update signal MUST be acknowledged by the receiver issuing a
   Peer Update ACK signal (Section 6.6).

6.6.  Peer Update ACK Signal

   A Peer Update ACK signal MUST be sent by implementations to indicate
   whether a Peer Update signal (Section 6.5) was successfully received.




Ratliff, et al.         Expires October 15, 2015               [Page 22]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   To construct a Peer Update ACK signal, the Signal Type value in the
   signal header is set to DLEP_PEER_UPDATE_ACK (value TBD).

   The Peer Update ACK signal MAY contain one of each of the following
   data items:

   o  Status (Section 7.2)

   A receiver of a Peer Update ACK signal without a Status data item
   MUST behave as if a Status data item with code 'Success' had been
   received.

6.7.  Peer Termination Signal

   A Peer Termination signal MUST be sent by a DLEP participant when the
   router/modem session needs to be terminated.  Implementations
   receiving a Peer Termination signal MUST send a Peer Termination ACK
   signal (Section 6.8) to confirm the termination process.

   The receiver of a Peer Termination signal MUST release all resources
   allocated for the router/modem session, and MUST eliminate all
   destinations in the information base accessible via the router/modem
   pair represented by the session.  Router and modem state machines are
   returned to the 'discovery' state.  No Destination Down signals
   (Section 6.11) are sent.

   The sender of a Peer Termination signal is free to define its
   heuristics in event of a timeout.  It may resend the Peer Termination
   or free resources and return to the 'discovery' state.

   To construct a Peer Termination signal, the Signal Type value in the
   signal header is set to DLEP_PEER_TERMINATION (value TBD).

   The Peer Termination signal MAY contain one of each of the following
   data items:

   o  Status (Section 7.2)

   A receiver of a Peer Termination signal without a Status data item
   MUST behave as if a Status data item with status code 'Success',
   implying graceful termination, had been received.

   A Peer Termination signal MUST be acknowledged by the receiver
   issuing a Peer Termination ACK signal (Section 6.8).







Ratliff, et al.         Expires October 15, 2015               [Page 23]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


6.8.  Peer Termination ACK Signal

   A Peer Termination ACK signal MUST be sent by a DLEP peer in response
   to a received Peer Termination signal (Section 6.7).  Receipt of a
   Peer Termination ACK signal completes the teardown of the router/
   modem session.

   To construct a Peer Termination ACK signal, the Signal Type value in
   the signal header is set to DLEP_PEER_TERMINATION_ACK (value TBD).

   The Peer Termination ACK signal MAY contain one of each of the
   following data items:

   o  Status (Section 7.2)

   A receiver of a Peer Termination ACK signal without a Status data
   item MUST behave as if a Status data item with status code 'Success',
   implying graceful termination, had been received.

6.9.  Destination Up Signal

   A Destination Up signal can be sent either by the modem, to indicate
   that a new remote node has been detected, or by the router, to
   indicate the presence of a new logical destination (e.g., a Multicast
   group) in the network.

   A Destination Up signal MUST be acknowledged by the receiver issuing
   a Destination Up ACK signal (Section 6.10).  The sender of the
   Destination Up signal is free to define its retry heuristics in event
   of a timeout.  When a Destination Up signal is received and
   successfully processed, the receiver should add knowledge of the new
   destination to its information base, indicating that the destination
   is accessible via the modem/router pair.

   To construct a Destination Up signal, the Signal Type value in the
   signal header is set to DLEP_DESTINATION_UP (value TBD).

   The Destination Up signal MUST contain one of each of the following
   data items:

   o  MAC Address (Section 7.9)

   The Destination Up signal MAY contain one of each of the following
   data items:

   o  Maximum Data Rate (Receive) (Section 7.14)

   o  Maximum Data Rate (Transmit) (Section 7.15)



Ratliff, et al.         Expires October 15, 2015               [Page 24]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   o  Current Data Rate (Receive) (Section 7.16)

   o  Current Data Rate (Transmit) (Section 7.17)

   o  Latency (Section 7.18)

   o  Resources (Receive) (Section 7.19)

   o  Resources (Transmit) (Section 7.20)

   o  Relative Link Quality (Receive) (Section 7.21)

   o  Relative Link Quality (Transmit) (Section 7.22)

   The Destination Up signal MAY contain one or more of the following
   data items, with different values:

   o  IPv4 Address (Section 7.10)

   o  IPv6 Address (Section 7.11)

   o  IPv4 Attached Subnet (Section 7.12)

   o  IPv6 Attached Subnet (Section 7.13)

   If the sender has IPv4 and/or IPv6 address information for a
   destination it SHOULD include the relevant data items in the
   Destination Up signal, reducing the need for the receiver to probe
   for any address.

6.10.  Destination Up ACK Signal

   A DLEP participant MUST send a Destination Up ACK signal to indicate
   whether a Destination Up signal (Section 6.9) was successfully
   processed.

   To construct a Destination Up ACK signal, the Signal Type value in
   the signal header is set to DLEP_DESTINATION_UP_ACK (value TBD).

   The Destination Up ACK signal MUST contain one of each of the
   following data items:

   o  MAC Address (Section 7.9)

   The Destination Up ACK signal MAY contain one of each of the
   following data items:

   o  Status (Section 7.2)



Ratliff, et al.         Expires October 15, 2015               [Page 25]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   A receiver of a Destination Up ACK signal without a Status data item
   MUST behave as if a Status data item with status code 'Success' had
   been received.

6.11.  Destination Down Signal

   A DLEP peer MUST send a Destination Down signal to report when a
   destination (a remote node or a multicast group) is no longer
   reachable.  A Destination Down ACK signal (Section 6.12) MUST be sent
   by the recipient of a Destination Down signal to confirm that the
   relevant data has been removed from the information base.  The sender
   of the Destination Down signal is free to define its retry heuristics
   in event of a timeout.

   To construct a Destination Down signal, the Signal Type value in the
   signal header is set to DLEP_DESTINATION_DOWN (value TBD).

   The Destination Down signal MUST contain one of each of the following
   data items:

   o  MAC Address (Section 7.9)

6.12.  Destination Down ACK Signal

   A DLEP participant MUST send a Destination Down ACK signal to
   indicate whether a received Destination Down signal (Section 6.11)
   was successfully processed.  If successfully processed, the sender of
   the ACK MUST have removed all entries in the information base that
   pertain to the referenced destination.

   To construct a Destination Down ACK signal, the Signal Type value in
   the signal header is set to DLEP_DESTINATION_DOWN_ACK (value TBD).

   The Destination Down ACK signal MUST contain one of each of the
   following data items:

   o  MAC Address (Section 7.9)

   The Destination Down ACK signal MAY contain one of each of the
   following data items:

   o  Status (Section 7.2)

   A receiver of a Destination Down ACK signal without a Status data
   item MUST behave as if a Status data item with status code 'Success'
   had been received.





Ratliff, et al.         Expires October 15, 2015               [Page 26]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


6.13.  Destination Update Signal

   A DLEP participant SHOULD send the Destination Update signal when it
   detects some change in the information base for a given destination
   (remote node or multicast group).  Some examples of changes that
   would prompt a Destination Update signal are:

   o  Change in link metrics (e.g., Data Rates)

   o  Layer 3 addressing change

   To construct a Destination Update signal, the Signal Type value in
   the signal header is set to DLEP_DESTINATION_UPDATE (value TBD).

   The Destination Update signal MUST contain one of each of the
   following data items:

   o  MAC Address (Section 7.9)

   The Destination Update signal MAY contain one of each of the
   following data items:

   o  Maximum Data Rate (Receive) (Section 7.14)

   o  Maximum Data Rate (Transmit) (Section 7.15)

   o  Current Data Rate (Receive) (Section 7.16)

   o  Current Data Rate (Transmit) (Section 7.17)

   o  Latency (Section 7.18)

   o  Resources (Receive) (Section 7.19)

   o  Resources (Transmit) (Section 7.20)

   o  Relative Link Quality (Receive) (Section 7.21)

   o  Relative Link Quality (Transmit) (Section 7.22)

   The Destination Update signal MAY contain one or more of the
   following data items, with different values:

   o  IPv4 Address (Section 7.10)

   o  IPv6 Address (Section 7.11)

   o  IPv4 Attached Subnet (Section 7.12)



Ratliff, et al.         Expires October 15, 2015               [Page 27]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   o  IPv6 Attached Subnet (Section 7.13)

6.14.  Heartbeat Signal

   A Heartbeat signal SHOULD be sent by a DLEP participant every N
   seconds, where N is defined in the Heartbeat Interval data item of
   the Peer Initialization signal (Section 6.3) or Peer Initialization
   ACK signal (Section 6.4).  Note that implementations setting the
   Heartbeat Interval to 0 effectively set the interval to an infinite
   value, therefore, in those cases, this signal SHOULD NOT be sent.

   The signal is used by participants to detect when a DLEP session
   partner (either the modem or the router) is no longer communicating.
   Participants SHOULD allow two (2) heartbeat intervals to expire with
   no traffic on the router/modem session before initiating DLEP session
   termination procedures.

   To construct a Heartbeat signal, the Signal Type value in the signal
   header is set to DLEP_PEER_HEARTBEAT (value TBD).

   There are no valid data items for the Heartbeat signal.

6.15.  Link Characteristics Request Signal

   The Link Characteristics Request signal MAY be sent by the router to
   request that the modem initiate changes for specific characteristics
   of the link.  The request can reference either a real destination
   (e.g., a remote node), or a logical destination (e.g., a multicast
   group) within the network.

   The Link Characteristics Request signal contains either a Current
   Data Rate (CDRR or CDRT) data item to request a different datarate
   than what is currently allocated, a Latency data item to request that
   traffic delay on the link not exceed the specified value, or both.  A
   Link Characteristics ACK signal (Section 6.16) is required to
   complete the request.  Issuing a Link Characteristics Request with
   ONLY the MAC Address data item is a mechanism a peer MAY use to
   request metrics (via the Link Characteristics ACK) from its partner.

   The sender of a Link Characteristics Request signal MAY attach a
   timer to the request using the Link Characteristics ACK Timer data
   item.  If a Link Characteristics ACK signal is received after the
   timer expires, the sender MUST NOT assume that the request succeeded.
   Implementations are free to define their retry heuristics in event of
   a timeout.

   To construct a Link Characteristics Request signal, the Signal Type
   value in the signal header is set to DLEP_LINK_CHAR_REQ (value TBD).



Ratliff, et al.         Expires October 15, 2015               [Page 28]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   The Link Characteristics Request signal MUST contain one of each of
   the following data items:

   o  MAC Address (Section 7.9)

   The Link Characteristics Request signal MAY contain one of each of
   the following data items:

   o  Link Characteristics ACK Timer (Section 7.23)

   o  Current Data Rate (Receive) (Section 7.16)

   o  Current Data Rate (Transmit) (Section 7.17)

   o  Latency (Section 7.18)

6.16.  Link Characteristics ACK Signal

   A DLEP participant MUST send a Link Characteristics ACK signal to
   indicate whether a received Link Characteristics Request signal
   (Section 6.15) was successfully processed.  The Link Characteristics
   ACK signal SHOULD contain a complete set of metric data items, and
   MUST contain a full set (i.e. those declared in the Peer
   Initialization ACK signal (Section 6.4)), if metrics were requested
   by only including a MAC address data item.  It MUST contain the same
   metric types as the request.  The values in the metric data items in
   the Link Characteristics ACK signal MUST reflect the link
   characteristics after the request has been processed.

   If an implementation is not able to alter the characteristics of the
   link in the manner requested, then a Status data item with status
   code 'Request Denied' MUST be added to the signal.

   To construct a Link Characteristics Request ACK signal, the Signal
   Type value in the signal header is set to DLEP_LINK_CHAR_ACK (value
   TBD).

   The Link Characteristics ACK signal MUST contain one of each of the
   following data items:

   o  MAC Address (Section 7.9)

   The Link Characteristics ACK signal SHOULD contain one of each of the
   following data items:

   o  Maximum Data Rate (Receive) (Section 7.14)

   o  Maximum Data Rate (Transmit) (Section 7.15)



Ratliff, et al.         Expires October 15, 2015               [Page 29]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   o  Current Data Rate (Receive) (Section 7.16)

   o  Current Data Rate (Transmit) (Section 7.17)

   o  Latency (Section 7.18)

   The Link Characteristics ACK signal MAY contain one of each of the
   following data items:

   o  Resources (Receive) (Section 7.19)

   o  Resources (Transmit) (Section 7.20)

   o  Relative Link Quality (Receive) (Section 7.21)

   o  Relative Link Quality (Transmit) (Section 7.22)

   o  Status (Section 7.2)

   A receiver of a Link Characteristics ACK signal without a Status data
   item MUST behave as if a Status data item with status code 'Success'
   had been received.

7.  DLEP Data Items

   Following is the list of MANDATORY data items that must be recognized
   by a DLEP compliant implementation.  As mentioned before, not all
   data items need be used during a session, but an implementation MUST
   correctly process these data items when correctly associated with a
   signal.

   The DLEP data items are:



















Ratliff, et al.         Expires October 15, 2015               [Page 30]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   +------------+--------------------------------------+---------------+
   | Data Item  | Description                          | Section       |
   +------------+--------------------------------------+---------------+
   | TBD        | DLEP Version                         | Section 7.1   |
   | TBD        | Status                               | Section 7.2   |
   | TBD        | IPv4 Connection Point                | Section 7.3   |
   | TBD        | IPv6 Connection Point                | Section 7.4   |
   | TBD        | Peer Type                            | Section 7.5   |
   | TBD        | Heartbeat Interval                   | Section 7.6   |
   | TBD        | Extensions Supported                 | Section 7.7   |
   | TBD        | Experimental Definition              | Section 7.8   |
   | TBD        | MAC Address                          | Section 7.9   |
   | TBD        | IPv4 Address                         | Section 7.10  |
   | TBD        | IPv6 Address                         | Section 7.11  |
   | TBD        | IPv4 Attached Subnet                 | Section 7.12  |
   | TBD        | IPv6 Attached Subnet                 | Section 7.13  |
   | TBD        | Maximum Data Rate (Receive) MDRR)    | Section 7.14  |
   | TBD        | Maximum Data Rate (Transmit) (MDRT)  | Section 7.15  |
   | TBD        | Current Data Rate (Receive) (CDRR)   | Section 7.16  |
   | TBD        | Current Data Rate (Transmit) (CDRT)  | Section 7.17  |
   | TBD        | Latency                              | Section 7.18  |
   | TBD        | Resources (Receive) (RESR)           | Section 7.19  |
   | TBD        | Resources (Transmit) (REST)          | Section 7.20  |
   | TBD        | Relative Link Quality (Receive)      | Section 7.21  |
   |            | (RLQR)                               |               |
   | TBD        | Relative Link Quality (Transmit)     | Section 7.22  |
   |            | (RLQT)                               |               |
   | TBD        | Link Characteristics ACK Timer       | Section 7.23  |
   +------------+--------------------------------------+---------------+

7.1.  DLEP Version

   The DLEP Version data item MUST appear in the Peer Discovery
   (Section 6.1), Peer Offer (Section 6.2), Peer Initialization
   (Section 6.3) and Peer Initialization ACK (Section 6.4) signals The
   Version data item is used to indicate the version of the protocol
   running in the originator.  A DLEP implementation SHOULD use this
   information to decide if the potential session partner is running at
   a supported level.

   The DLEP Version data item contains the following fields:










Ratliff, et al.         Expires October 15, 2015               [Page 31]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |         Major Version         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       Minor Version           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  4

   Major Version:  The major version of the DLEP protocol, expressed as
      an 16-bit unsigned integer.

   Minor Version:  The minor version of the DLEP protocol, expressed as
      an 16-bit unsigned integer.

   Support of this draft is indicated by setting the Major Version to
   '0', and the Minor Version to '9' (i.e.  Version 0.9).

7.2.  Status

   The Status data item MAY appear in the Peer Initialization ACK
   (Section 6.4), Peer Termination (Section 6.7), Peer Termination ACK
   (Section 6.8), Peer Update ACK (Section 6.6), Destination Up ACK
   (Section 6.10), Destination Down ACK (Section 6.12) and Link
   Characteristics ACK (Section 6.16) signals as part of an
   acknowledgement from either the modem or the router, to indicate the
   success or failure of the previously received signal.

   The status data item includes an optional Text field that can be used
   to provide a textual description of the status.  The use of the Text
   field is entirely up to the receiving implementation, i.e., it could
   be output to a log file or discarded.  If no Text field is supplied
   with the Status data item, the Length field MUST be set to 1.

   The Status data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |     Code      | Text...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  1 + Length of text



Ratliff, et al.         Expires October 15, 2015               [Page 32]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   Status Code:  One of the codes defined below.

   Text:  UTF-8 encoded string, describing an problem, used for
      implementation defined purposes.

   An implementation MUST NOT assume the Text field is NUL-terminated.

   +----------------+-------+------------------------------------------+
   | Status Code    | Value | Reason                                   |
   +----------------+-------+------------------------------------------+
   | Success        | 0     | The signal was processed successfully.   |
   | Unknown Signal | TBD   | The signal was not recognized by the     |
   |                |       | implementation.                          |
   | Invalid Data   | TBD   | One or more data items in the signal are |
   |                |       | invalid, unexpected or duplicated.       |
   | Unexpected     | TBD   | The signal was not expected while the    |
   | Signal         |       | machine was in this state, e.g., a Peer  |
   |                |       | Initialization signal after session      |
   |                |       | establishment.                           |
   | Request Denied | TBD   | The receiver has not completed the       |
   |                |       | request.                                 |
   | Timed Out      | TBD   | The request could not be completed in    |
   |                |       | the time allowed.                        |
   | Invalid        | TBD   | The destination provided in the signal   |
   | Destination    |       | does not match a previously announced    |
   |                |       | destination. For example, in the Link    |
   |                |       | Characteristic Request ACK signal        |
   |                |       | (Section 6.16).                          |
   +----------------+-------+------------------------------------------+

7.3.  IPv4 Connection Point

   The IPv4 Connection Point data item MAY appear in the Peer Offer
   signal (Section 6.2).  The IPv4 Connection Point data item indicates
   the IPv4 address and, optionally, the TCP port number on the DLEP
   modem available for connections.  If provided, the receiver MUST use
   this information to perform the TCP connect to the DLEP server.

   The IPv4 Connection Point data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |          IPv4 Address         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          IPv4 Address         |   TCP Port Number (optional)  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




Ratliff, et al.         Expires October 15, 2015               [Page 33]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   Data Item Type:  TBD

   Length:  4 (or 6 if TCP Port included)

   IPv4 Address:  The IPv4 address listening on the DLEP modem.

   TCP Port Number:  TCP Port number on the DLEP modem.

   If the Length field is 6, the port number specified MUST be used to
   establish the TCP session.  If the TCP Port Number is omitted, i.e.
   the Length field is 4, the receiver MUST use the DLEP well-known port
   number (Section 10.7) to establish the TCP connection.

7.4.  IPv6 Connection Point

   The IPv6 Connection Point data item MAY appear in the Peer Offer
   signal (Section 6.2).  The IPv6 Connection Point data item indicates
   the IPv6 address and, optionally, the TCP port number on the DLEP
   modem available for connections.  If provided, the receiver MUST use
   this information to perform the TCP connect to the DLEP server.

   The IPv4 Connection Point data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |          IPv6 Address         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          IPv6 Address         |   TCP Port Number (optional)  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  16 (or 18 if TCP Port included)

   IPv6 Address:  The IPv6 address listening on the DLEP modem.

   TCP Port Number:  TCP Port number on the DLEP modem.

   If the Length field is 18, the port number specified MUST be used to
   establish the TCP session.  If the TCP Port Number is omitted, i.e.




Ratliff, et al.         Expires October 15, 2015               [Page 34]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   the Length field is 16, the receiver MUST use the DLEP well-known
   port number (Section 10.7) to establish the TCP connection.

7.5.  Peer Type

   The Peer Type data item MAY appear in the Peer Discovery
   (Section 6.1), Peer Offer (Section 6.2), Peer Initialization
   (Section 6.3) and Peer Initialization ACK (Section 6.4) signals.  The
   Peer Type data item is used by the router and modem to give
   additional information as to its type.  The peer type is a string and
   is envisioned to be used for informational purposes (e.g., as output
   in a display command).

   The Peer Type data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | Peer Type                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  Length of peer type string.

   Peer Type:  UTF-8 encoded string.  For example, a satellite modem
      might set this variable to "Satellite terminal".

   An implementation MUST NOT assume the Peer Type field is NUL-
   terminated.

7.6.  Heartbeat Interval

   The Heartbeat Interval data item MUST appear in both the Peer
   Initialization (Section 6.3) and Peer Initialization ACK
   (Section 6.4) signals to indicate the Heartbeat timeout window to be
   used by the sender.

   The Interval is used to specify a period (in seconds) for Heartbeat
   signals (Section 6.14).  By specifying an Interval value of 0,
   implementations MAY indicates the desire to disable Heartbeat signals
   entirely (i.e., the Interval is set to an infinite value).  However,
   it is strongly recommended that implementations use non 0 timer
   values.  Implementations MUST implement heuristics such that DLEP
   signals sent/received reset the timer interval.

   A DLEP session will be considered inactive, and MUST be torn down,
   via the Peer Termination procedure, by an implementation detecting



Ratliff, et al.         Expires October 15, 2015               [Page 35]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   that two (2) Heartbeat intervals have transpired without receipt of
   any DLEP signals.

   The Heartbeat Interval data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |           Interval            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  2

   Interval:  0 = Do NOT use heartbeats on this DLEP session.  Non-zero
      = Interval, in seconds, for heartbeat signals.

7.7.  Extensions Supported

   The Extensions Supported data item MAY be used in both the Peer
   Initialization and Peer Initialization ACK signals.  The Extensions
   Supported data item is used by the router and modem to negotiate
   additional optional functionality they are willing to support.  The
   Extensions List is a concatenation of the types of each supported
   extension, found in the IANA DLEP Extensions repository.

   The Extensions Supported data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | Extensions List               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  Number of Extensions supported.

   Extension List:  A list of extensions supported, identified by their
      1-octet value as listed in the extensions registry.

7.8.  Experimental Definition

   The Experimental Definition data item MAY be used in both the Peer
   Initialization and Peer Initialization ACK signals.  The Experimental
   Definition data item is used by the router and modem to indicate the
   formats to be used for experimental signals and data items for the



Ratliff, et al.         Expires October 15, 2015               [Page 36]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   given peer session.  The formats are identified by using a string
   that matches the 'name' given to the experiment.

   The Experimental Definition item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | Experiment Name               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  Length of the name string for the Experiment.

   Experiment Name:  UTF-8 encoded string, containing the name of the
      experiment being utilized.

   An implementation receiving this data item MUST compare the received
   string to a list of experiments that it supports.

   An implementation MUST NOT assume the Experiment Name field is NUL-
   terminated.

7.9.  MAC Address

   The MAC address data item MUST appear in all destination-oriented
   signals (i.e., Destination Up (Section 6.9), Destination Up ACK
   (Section 6.10), Destination Down (Section 6.11), Destination Down ACK
   (Section 6.12), Destination Update (Section 6.13), Link
   Characteristics Request (Section 6.15), and Link Characteristics ACK
   (Section 6.16)).  The MAC Address data item contains the address of
   the destination on the remote node.  The MAC address MAY be either a
   physical or a virtual destination.  Examples of a virtual destination
   would be a multicast MAC address, or the broadcast MAC
   (FF:FF:FF:FF:FF:FF).

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |          MAC Address          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      MAC Address                              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  6



Ratliff, et al.         Expires October 15, 2015               [Page 37]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   MAC Address:  MAC Address of the destination.

7.10.  IPv4 Address

   The IPv4 Address data item MAY appear in the Peer Update
   (Section 6.5), Destination Up (Section 6.9) and Destination Update
   (Section 6.13) signals.  When included in Destination signals, this
   data item contains the IPv4 address of the destination.  When
   included in the Peer Update signal, this data item contains the IPv4
   address of the peer.  In either case, the data item also contains an
   indication of whether this is a new or existing address, or is a
   deletion of a previously known address.

   The IPv4 Address data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |   Add/Drop    | IPv4 Address  |
   |               |               |   Indicator   |               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |            IPv4 Address                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  5

   Add/Drop:  Value indicating whether this is a new or existing address
      (1), or a withdrawal of an address (0).

   IPv4 Address:  The IPv4 address of the destination or peer.

7.11.  IPv6 Address

   The IPv6 Address data item MAY appear in the Peer Update
   (Section 6.5), Destination Up (Section 6.9) and Destination Update
   (Section 6.13) signals.  When included in Destination signals, this
   data item contains the IPv6 address of the destination.  When
   included in the Peer Update signal, this data item contains the IPv4
   address of the peer.  In either case, the data item also contains an
   indication of whether this is a new or existing address, or is a
   deletion of a previously known address.

   The IPv6 Address data item contains the following fields:






Ratliff, et al.         Expires October 15, 2015               [Page 38]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |   Add/Drop    | IPv6 Address  |
   |               |               |   Indicator   |               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        IPv6 Address                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                IPv6 Address                   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  17

   Add/Drop:  Value indicating whether this is a new or existing address
      (1), or a withdrawal of an address (0).

   IPv6 Address:  IPv6 Address of the destination or peer.

7.12.  IPv4 Attached Subnet

   The DLEP IPv4 Attached Subnet allows a device to declare that it has
   an IPv4 subnet (e.g., a stub network) attached, and MAY appear in the
   Destination Up (Section 6.9) and Destination Update (Section 6.13)
   signals.  Once an IPv4 Subnet has been declared on a device, the
   declaration can NOT be withdrawn without terminating the destination
   (via the Destination Down signal (Section 6.11)) and re-issuing the
   Destination Up signal.

   The DLEP IPv4 Attached Subnet data item contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |Data Item Type |    Length     | IPv4 Attached Subnet          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv4 Attached Subnet     | Subnet Mask   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  5



Ratliff, et al.         Expires October 15, 2015               [Page 39]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   IPv4 Subnet:  The IPv4 subnet reachable at the destination.

   Subnet Mask:  A subnet mask (0-32) to be applied to the IPv4 subnet.

7.13.  IPv6 Attached Subnet

   The DLEP IPv6 Attached Subnet allows a device to declare that it has
   an IPv6 subnet (e.g., a stub network) attached, and MAY appear in the
   Destination Up (Section 6.9) and Destination Update (Section 6.13)
   signals.  As in the case of the IPv4 attached Subnet data item above,
   once an IPv6 attached subnet has been declared, it can NOT be
   withdrawn without terminating the destination (via the Destination
   Down signal (Section 6.11)) and re-issuing the Destination Up signal.

   The DLEP IPv6 Attached Subnet data item contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | IPv6 Attached Subnet          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv6 Attached Subnet                                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv6 Attached Subnet                                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv6 Attached Subnet                                     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      IPv6 Attached Subnet     | Subnet Mask   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  17

   IPv4 Subnet:  The IPv6 subnet reachable at the destination.

   Subnet Mask:  A subnet mask (0-128) to be applied to the IPv6 subnet.

7.14.  Maximum Data Rate (Receive)

   The Maximum Data Rate (Receive) (MDRR) data item MUST appear in the
   Peer Initialization ACK signal (Section 6.4), and MAY appear in the
   Peer Update (Section 6.5), Destination Up (Section 6.9), Destination
   Update (Section 6.13) and Link Characteristics ACK (Section 6.16)
   signals to indicate the maximum theoretical data rate, in bits per
   second, that can be achieved while receiving data on the link.




Ratliff, et al.         Expires October 15, 2015               [Page 40]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   The Maximum Data Rate (Receive) data item contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |          MDRR (bps)           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        MDRR (bps)                             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           MDRR (bps)          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  8

   Maximum Data Rate (Receive):  A 64-bit unsigned integer, representing
      the maximum theoretical data rate, in bits per second (bps), that
      can be achieved while receiving on the link.

7.15.  Maximum Data Rate (Transmit)

   The Maximum Data Rate (Transmit) (MDRT) data item MUST appear in the
   Peer Initialization ACK signal (Section 6.4), and MAY appear in the
   Peer Update (Section 6.5), Destination Up (Section 6.9), Destination
   Update (Section 6.13) and Link Characteristics ACK (Section 6.16)
   signals to indicate the maximum theoretical data rate, in bits per
   second, that can be achieved while transmitting data on the link.

   The Maximum Data Rate (Transmit) data item contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |          MDRT (bps)           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        MDRT (bps)                             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |           MDRT (bps)          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  8





Ratliff, et al.         Expires October 15, 2015               [Page 41]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   Maximum Data Rate (Transmit):  A 64-bit unsigned integer,
      representing the maximum theoretical data rate, in bits per second
      (bps), that can be achieved while transmitting on the link.

7.16.  Current Data Rate (Receive)

   The Current Data Rate (Receive) (CDRR) data item MUST appear in the
   Peer Initialization ACK signal (Section 6.4), and MAY appear in the
   Peer Update (Section 6.5), Destination Up (Section 6.9), Destination
   Update (Section 6.13) and Link Characteristics ACK (Section 6.16)
   signals to indicate the rate at which the link is currently operating
   for receiving traffic.

   When used in the Link Characteristics Request signal (Section 6.15),
   CDRR represents the desired receive rate, in bits per second, on the
   link.

   The Current Data Rate (Receive) data item contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | CDRR (bps)                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        CDRR (bps)                             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        CDRR (bps)             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  8

   Current Data Rate (Receive):  A 64-bit unsigned integer, representing
      the current data rate, in bits per second, that can currently be
      achieved while receiving traffic on the link.

   If there is no distinction between current and maximum receive data
   rates, current data rate receive MUST be set equal to the maximum
   data rate receive.

7.17.  Current Data Rate (Transmit)

   The Current Data Rate Transmit (CDRT) data item MUST appear in the
   Peer Initialization ACK signal (Section 6.4), and MAY appear in the
   Peer Update (Section 6.5), Destination Up (Section 6.9), Destination
   Update (Section 6.13), and Link Characteristics ACK (Section 6.16)



Ratliff, et al.         Expires October 15, 2015               [Page 42]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   signals to indicate the rate at which the link is currently operating
   for transmitting traffic.

   When used in the Link Characteristics Request signal (Section 6.15),
   CDRT represents the desired transmit rate, in bits per second, on the
   link.

   The Current Data Rate (Transmit) data item contains the following
   fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | CDRT (bps)                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        CDRT (bps)                             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        CDRT (bps)             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  8

   Current Data Rate (Transmit):  A 64-bit unsigned integer,
      representing the current data rate, in bits per second, that can
      currently be achieved while transmitting traffic on the link.

   If there is no distinction between current and maximum transmit data
   rates, current data rate transmit MUST be set equal to the maximum
   data rate transmit.

7.18.  Latency

   The Latency data item data item MUST appear in the Peer
   Initialization ACK signal (Section 6.4), and MAY appear in the Peer
   Update (Section 6.5), Destination Up (Section 6.9), Destination
   Update (Section 6.13), and Link Characteristics ACK (Section 6.16)
   signals to indicate the amount of latency, in microseconds, on the
   link.

   When used in the Link Characteristics Request signal (Section 6.15),
   Latency represents the maximum latency desired on the link.

   The Latency value is reported as delay.  The calculation of latency
   is implementation dependent.  For example, the latency may be a
   running average calculated from the internal queuing.




Ratliff, et al.         Expires October 15, 2015               [Page 43]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | Latency                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Latency (cont.)              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  4

   Latency:  A 32-bit unsigned integer, representing the transmission
      delay, in microseconds, that a packet encounters as it is
      transmitted over the link.

7.19.  Resources (Receive)

   The Resources (Receive) (RESR) data item MAY appear in the Peer
   Initialization ACK signal (Section 6.4), Peer Update (Section 6.5),
   Destination Up (Section 6.9), Destination Update (Section 6.13) and
   Link Characteristics ACK (Section 6.16) signals to indicate the
   amount of resources for reception (with 0 meaning 'no resources
   available', and 100 meaning 'all resources available') at the
   destination.  The list of resources that might be considered is
   beyond the scope of this document, and is left to implementations to
   decide.

   The Resources (Receive) data item contains the following fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |     RESR      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  1

   Resources (Receive):  An 8-bit integer percentage, 0-100,
      representing the amount of resources allocated to receiving data.

   If a device cannot calculate RESR, this data item SHOULD NOT be
   issued.






Ratliff, et al.         Expires October 15, 2015               [Page 44]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


7.20.  Resources (Transmit)

   The Resources (Transmit) (REST) data item MAY appear in the Peer
   Initialization ACK signal (Section 6.4), Peer Update (Section 6.5),
   Destination Up (Section 6.9), Destination Update (Section 6.13) and
   Link Characteristics ACK (Section 6.16) signals to indicate the
   amount of resources for transmission (with 0 meaning 'no resources
   available', and 100 meaning 'all resources available') at the
   destination.  The list of resources that might be considered is
   beyond the scope of this document, and is left to implementations to
   decide.

   The Resources (Transmit) data item contains the following fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |     REST      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  1

   Resources (Transmit):  An 8-bit integer percentage, 0-100,
      representing the amount of resources allocated to transmitting
      data.

   If a device cannot calculate REST, this data item SHOULD NOT be
   issued.

7.21.  Relative Link Quality (Receive)

   The Relative Link Quality (Receive) (RLQR) data item MAY appear in
   the Peer Initialization ACK signal (Section 6.4), Peer Update
   (Section 6.5), Destination Up (Section 6.9), Destination Update
   (Section 6.13) and Link Characteristics ACK (Section 6.16) signals to
   indicate the quality of the link for receiving data.

   The Relative Link Quality (Receive) data item contains the following
   fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |     RLQR      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




Ratliff, et al.         Expires October 15, 2015               [Page 45]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   Data Item Type:  TBD

   Length:  1

   Relative Link Quality (Receive):  A non-dimensional 8-bit integer,
      1-100, representing relative link quality.  A value of 100
      represents a link of the highest quality.

   If a device cannot calculate the RLQR, this data item SHOULD NOT be
   issued.

7.22.  Relative Link Quality (Transmit)

   The Relative Link Quality (Transmit) (RLQT) data item MAY appear in
   the Peer Initialization ACK signal (Section 6.4), Peer Update
   (Section 6.5), Destination Up (Section 6.9), Destination Update
   (Section 6.13) and Link Characteristics ACK (Section 6.16) signals to
   indicate the quality of the link for transmitting data.

   The Relative Link Quality (Transmit) data item contains the following
   fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |     RLQT      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  1

   Relative Link Quality (Transmit):  A non-dimensional 8-bit integer,
      1-100, representing relative link quality.  A value of 100
      represents a link of the highest quality.

   If a device cannot calculate the RLQT, this data item SHOULD NOT be
   issued.

7.23.  Link Characteristics ACK Timer

   The Link Characteristics ACK Timer data item MAY appear in the Link
   Characteristics Request signal (Section 6.15) to indicate the desired
   number of seconds to the sender will wait for a response to the
   request.  If this data item is omitted, implementations supporting
   the Link Characteristics Request SHOULD choose a default value.





Ratliff, et al.         Expires October 15, 2015               [Page 46]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   The Link Characteristics ACK Timer data item contains the following
   fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | Interval      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  1

   Interval:  0 = Do NOT use timeouts for this Link Characteristics
      request.  Non-zero = Interval, in seconds, to wait before
      considering this Link Characteristics Request has been lost.

8.  Credit-Windowing

   DLEP includes an OPTIONAL Protocol Extension for a credit-windowing
   scheme analogous to the one documented in [RFC5578].  In this scheme,
   traffic between the router and modem is treated as two unidirectional
   windows.  This document identifies these windows as the 'Modem
   Receive Window' (MRW), and the 'Router Receive Window' (RRW).

   If the OPTIONAL credit-windowing extension is used, credits MUST be
   granted by the receiver on a given window - that is, on the 'Modem
   Receive Window' (MRW), the modem is responsible for granting credits
   to the router, allowing it (the router) to send data to the modem.
   Likewise, the router is responsible for granting credits on the RRW,
   which allows the modem to send data to the router.

   Credits are managed on a destination-specific basis; that is,
   separate credit counts are maintained for each destination requiring
   the service.  Credits do not apply to the DLEP session that exists
   between routers and modems.

   If a peer is able to support the OPTIONAL credit-windowing extension
   then it MUST include a Extensions Supported data item (Section 7.7)
   including the value DLEP_EXT_CREDITS (value TBD) in the appropriate
   Peer Initialization or Peer Initialization ACK signal.

8.1.  Credit-Windowing Signals

   The credit-windowing extension introduces no additional DLEP signals.
   However, if a peer has advertised during session initialization that
   it supports the credit-windowing extension then the following DLEP
   signals MAY contain additional credit-windowing data items:



Ratliff, et al.         Expires October 15, 2015               [Page 47]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


8.1.1.  Destination Up Signal

   The Destination Up signal MAY contain one of each of the following
   data items:

   o  Credit Grant (Section 8.2.1)

   If the Destination Up signal does not contain the Credit Grant data
   item, credits MUST NOT be used for that destination.

8.1.2.  Destination Up ACK Signal

   If the corresponding Destination Up signal contained the Credit Grant
   data item, the Destination Up ACK signal MUST contain one of each of
   the following data items:

   o  Credit Window Status (Section 8.2.2)

8.1.3.  Destination Update Signal

   If the corresponding Destination Up signal contained the Credit Grant
   data item, the Destination Update signal MUST contain one of each of
   the following data items:

   o  Credit Window Status (Section 8.2.2)

   If the corresponding Destination Up signal contained the Credit Grant
   data item, the Destination Update signal MAY contain one of each of
   the following data items:

   o  Credit Grant (Section 8.2.1)

   o  Credit Request (Section 8.2.3)

8.2.  Credit-Windowing Data Items

   The credit-windowing extension introduces 3 additional data items.
   If a peer has advertised during session initialization that it
   supports the credit-windowing extension then it MUST correctly
   process the following data items without error.

          +------------+-----------------------+----------------+
          | Data Item  | Description           | Section        |
          +------------+-----------------------+----------------+
          | TBD        | Credit Grant          | Section 8.2.1  |
          | TBD        | Credit Window Status  | Section 8.2.2  |
          | TBD        | Credit Request        | Section 8.2.3  |
          +------------+-----------------------+----------------+



Ratliff, et al.         Expires October 15, 2015               [Page 48]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


8.2.1.  Credit Grant

   The Credit Grant data item is sent from a DLEP participant to grant
   an increment to credits on a window.  The Credit Grant data item MAY
   appear in the Destination Up (Section 6.9) and Destination Update
   (Section 6.13) signals.  The value in a Credit Grant data item
   represents an increment to be added to any existing credits available
   on the window.  Upon successful receipt and processing of a Credit
   Grant data item, the receiver MUST respond with a signal containing a
   Credit Window Status data item to report the updated aggregate values
   for synchronization purposes, and if initializing a new credit
   window, granting initial credits.

   In the Destination Up signal, when credits are desired, the
   originating peer MUST set the initial credit value of the window it
   controls (i.e., the Modem Receive Window, or Router Receive Window)
   to an initial, non-zero value.  If the receiver of a Destination Up
   signal with a Credit Grant data item supports credits, the receiver
   MUST either reject the use of credits for this destination, via a
   Destination Up ACK response containing a Status data item
   (Section 7.2) with a status code of 'Request Denied', or set the
   initial value from the data contained in the Credit Window Status
   data item.  If the initialization completes successfully, the
   receiver MUST respond to the Destination Up signal with a Destination
   Up ACK signal that contains a Credit Window Status data item,
   initializing its receive window.

   The Credit Grant data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     |       Credit Increment        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Credit Increment                         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Credit Increment         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  8

   Reserved:  A 64-bit unsigned integer representing the additional
      credits to be assigned to the credit window.

   Since credits can only be granted by the receiver on a window, the
   applicable credit window (either the MRW or the RRW) is derived from



Ratliff, et al.         Expires October 15, 2015               [Page 49]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   the sender of the grant.  The Credit Increment MUST NOT cause the
   window to overflow; if this condition occurs, implementations MUST
   set the credit window to the maximum value contained in a 64-bit
   quantity.

8.2.2.  Credit Window Status

   If the credit-window extension is supported by the DLEP participants
   (both the router and the modem), the Credit Window Status data item
   MUST be sent by the participant receiving a Credit Grant for a given
   destination.

   The Credit Window Status data item contains the following fields:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | Modem Receive Window Value    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Modem Receive Window Value                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Modem Receive Window Value   | Router Receive Window Value   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                Router Receive Window Value                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Router Receive Window Value  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  16

   Modem Receive Window Value:  A 64-bit unsigned integer, indicating
      the current number of credits available on the Modem Receive
      Window, for the destination referred to by the signal.

   Router Receive Window Value:  A 64-bit unsigned integer, indicating
      the current number of credits available on the Router Receive
      Window, for the destination referred to by the signal.

8.2.3.  Credit Request

   The Credit Request data item MAY be sent from either DLEP
   participant, via the Destination Update signal (Section 6.13), to
   indicate the desire for the partner to grant additional credits in
   order for data transfer to proceed on the session.  If the
   corresponding Destination Up signal (Section 6.9) for this session
   did NOT contain a Credit Window Status data item, indicating that



Ratliff, et al.         Expires October 15, 2015               [Page 50]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   credits are to be used on the session, then the Credit Request data
   item MUST be silently dropped by the receiver.

   The Credit Request data item contains the following fields:

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Data Item Type|    Length     | Reserved, MUST|
   |               |               | be set to 0   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   Data Item Type:  TBD

   Length:  1

   Reserved:  This field is currently unused and MUST be set to 0.

9.  Security Considerations

   The protocol does not contain any mechanisms for security (e.g.,
   authentication or encryption).  The protocol assumes that any
   security would be implemented in the underlying transport (for
   example, by use of DTLS or some other mechanism), and is therefore
   outside the scope of this document.

10.  IANA Considerations

   This section specifies requests to IANA.

10.1.  Registrations

   This specification defines:

   o  A new repository for DLEP signals, with sixteen values currently
      assigned.

   o  Reservation of numbering space for Experimental DLEP signals.

   o  A new repository for DLEP data items, with twenty-six values
      currently assigned.

   o  Reservation of numbering space in the data items repository for
      experimental data items.

   o  A new repository for DLEP status codes, with seven currently
      assigned.




Ratliff, et al.         Expires October 15, 2015               [Page 51]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   o  A new repository for DLEP extensions, with one value currently
      assigned.

   o  A request for allocation of a well-known port for DLEP TCP and UDP
      communication.

   o  A request for allocation of a multicast IP address for DLEP
      discovery.

10.2.  Expert Review: Evaluation Guidelines

   No additional guidelines for expert review are anticipated.

10.3.  Signal Type Registration

   A new repository must be created with the values of the DLEP signals.

   All signal values are in the range [0..255].

   Valid signals are:

   o  Peer Discovery

   o  Peer Offer

   o  Peer Initialization

   o  Peer Initialization ACK

   o  Peer Update

   o  Peer Update ACK

   o  Peer Termination

   o  Peer Termination ACK

   o  Destination Up

   o  Destination Up ACK

   o  Destination Down

   o  Destination Down ACK

   o  Destination Update

   o  Heartbeat



Ratliff, et al.         Expires October 15, 2015               [Page 52]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   o  Link Characteristics Request

   o  Link Characteristics ACK

   It is also requested that the repository contain space for
   experimental signal types.

10.4.  DLEP Data Item Registrations

   A new repository for DLEP data items must be created.

   All data item values are in the range [0..255].

   Valid data items are:

   o  DLEP Version

   o  Status

   o  IPv4 Connection Point

   o  IPv6 Connection Point

   o  Peer Type

   o  Heartbeat Interval

   o  Extensions Supported

   o  Experimental Definition

   o  MAC Address

   o  IPv4 Address

   o  IPv6 Address

   o  IPv4 Attached Subnet

   o  IPv6 Attached Subnet

   o  Maximum Data Rate (Receive)

   o  Maximum Data Rate (Transmit)

   o  Current Data Rate (Receive)

   o  Current Data Rate (Transmit)



Ratliff, et al.         Expires October 15, 2015               [Page 53]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   o  Latency

   o  Resources (Receive)

   o  Resources (Transmit)

   o  Relative Link Quality (Receive)

   o  Relative Link Quality (Transmit)

   o  Link Characteristics ACK Timer

   o  Credit Window Status

   o  Credit Grant

   o  Credit Request

   It is also requested that the registry allocation contain space for
   experimental data items.

10.5.  DLEP Status Code Registrations

   A new repository for DLEP status codes must be created.

   All status codes are in the range [0..255].

   Valid status codes are:

   o  Success (value 0)

   o  Unknown Signal

   o  Invalid Data

   o  Unexpected Signal

   o  Request Denied

   o  Timed Out

   o  Invalid Destination

10.6.  DLEP Extensions Registrations

   A new repository for DLEP extensions must be created.

   All extension values are in the range [0..255].



Ratliff, et al.         Expires October 15, 2015               [Page 54]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   Valid extensions are:

   o  DLEP_EXT_CREDITS - Credit windowing

10.7.  DLEP Well-known Port

   It is requested that IANA allocate a well-known port number for DLEP
   communication.

10.8.  DLEP Multicast Address

   It is requested that IANA allocate a multicast address for DLEP
   discovery signals.

11.  Acknowledgements

   The authors would like to acknowledge and thank the members of the
   DLEP design team, who have provided invaluable insight.  The members
   of the design team are: Teco Boot, Bow-Nan Cheng, John Dowdell, and
   Henning Rogge.

   The authors would also like to acknowledge the influence and
   contributions of Greg Harrison, Chris Olsen, Martin Duke, Subir Das,
   Jaewon Kang, Vikram Kaul, Nelson Powell and Victoria Mercieca.

12.  References

12.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC5578]  Berry, B., Ratliff, S., Paradise, E., Kaiser, T., and M.
              Adams, "PPP over Ethernet (PPPoE) Extensions for Credit
              Flow and Link Metrics", RFC 5578, February 2010.

12.2.  Informative References

   [RFC5246]  Dierks, T. and E. Rescorla, "The Transport Layer Security
              (TLS) Protocol Version 1.2", RFC 5246, August 2008.

Appendix A.  Peer Level Signal Flows

A.1.  Discovery







Ratliff, et al.         Expires October 15, 2015               [Page 55]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


Router                       Modem    Signal Description
========================================================================

|                                     Router initiates discovery, starts
|                                     a timer, send Peer Discovery
|-------Peer Discovery---->||         signal.

         ~ ~ ~ ~ ~ ~ ~                Router discovery timer expires
                                      without receiving Peer Offer.

|                                     Router sends another Peer
|-------Peer Discovery---------->|    Discovery signal.
                                 |
                                 |    Modem receives Peer Discovery
                                 |    signal.
                                 |
                                 |    Modem sends Peer Offer with
|<--------Peer Offer-------------|    Connection Point information.
:
:                                     Router MAY cancel discovery timer
:                                     and stop sending Peer Discovery
:                                     signals.

A.2.  Session Initialization

Router                       Modem    Signal Description
========================================================================

|                                     Router connects to discovered or
|                                     pre-configured Modem Connection
|---------TCP connect---------->      Point.
|
|                                     Router sends Peer Initialization
|-------Peer Initialization----->|    signal.
                                 |
                                 |    Modem receives Peer Initialization
                                 |    signal.
                                 |
                                 |    Modem sends Peer Initialization
                                 |    ACK, with compatible extensions,
|<----Peer Initialization ACK----|    and Success status data item.
|                                |
|<<============================>>|    Session established. Heartbeats
:                                :    begin.







Ratliff, et al.         Expires October 15, 2015               [Page 56]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


A.3.  Session Initialization - Refused

Router                       Modem    Signal Description
========================================================================

|                                     Router connects to discovered or
|                                     pre-configured Modem Connection
|---------TCP connect---------->      Point.
|
|                                     Router sends Peer Initialization
|-------Peer Initialization----->|    signal.
                                 |
                                 |    Modem receives Peer Initialization
                                 |    signal, and will not support the
                                 |    advertised version, experiment or
                                 |    extensions.
                                 |
                                 |    Modem sends Peer Initialization
                                 |    ACK, with 'Request Denied' status
|<----Peer Initialization ACK----|    data item.
|                                |
|  <---- TCP shutdown (send)-----|    Modem closes TCP connection.
|
|                                     Router receives negative Peer
|                                     Initialization ACK, closes
|---------TCP close----------->       TCP connection.
|
||------------------------------||    Session not started.

A.4.  Router Changes IP Addresses

Router                       Modem    Signal Description
========================================================================

|                                     Router sends Peer Update signal to
|--------Peer Update------------>|    announce change of IP address
                                 |
                                 |    Modem receives Peer Update signal
                                 |    and updates internal state.
                                 |
|<-------Peer Update ACK---------|    Modem sends Peer Update ACK.

A.5.  Modem Changes Session-wide Metrics








Ratliff, et al.         Expires October 15, 2015               [Page 57]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


Router                       Modem    Signal Description
========================================================================

                                 |    Modem sends Peer Update signal to
                                 |    announce change of modem-wide
|<--------Peer Update------------|    metrics
|
|                                     Router receives Peer Update signal
|                                     and updates internal state.
|
|-------Peer Update ACK--------->|    Router sends Peer Update ACK.

A.6.  Router Terminates Session

Router                       Modem    Signal Description
========================================================================

|                                     Router sends Peer Termination
|-------Peer Termination-------->|    signal with Status data item.
|                                |
|-------TCP shutdown (send)--->  |    Router stops sending signals.
                                 |
                                 |    Modem receives Peer Termination,
                                 |    stops counting received heartbeats
                                 |    and stops sending heartbeats.
                                 |
                                 |    Modem sends Peer Termination ACK
|<-----Peer Termination ACK------|    with Status 'Success'.
|                                |
|  <----TCP shutdown (send)------|    Modem stops sending signals.
|
||------------------------------||    Session terminated.

A.7.  Modem Terminates Session

















Ratliff, et al.         Expires October 15, 2015               [Page 58]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


Router                       Modem    Signal Description
========================================================================

                                 |    Modem sends Peer Termination
|<------Peer Termination---------|    signal with Status data item.
|                                |
|  <----TCP shutdown (send)------|    Modem stops sending signals.
|
|                                     Router receives Peer Termination,
|                                     stops counting received heartbeats
|                                     and stops sending heartbeats.
|
|                                     Router sends Peer Termination ACK
|------Peer Termination ACK----->|    with Status 'Success'.
|                                |
|-------TCP shutdown (send)--->  |    Router stops sending signals.
                                 |
||------------------------------||    Session terminated.

A.8.  Session Heartbeats































Ratliff, et al.         Expires October 15, 2015               [Page 59]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


Router                       Modem    Signal Description
========================================================================

|----------Heartbeat------------>|    Router sends heartbeat signal
                                 |
                                 |    Modem resets heartbeats missed
                                 |    counter.

         ~ ~ ~ ~ ~ ~ ~

|----------[Any signal]--------->|    When the Modem receives any signal
                                 |    from the Router.
                                 |
                                 |    Modem resets heartbeats missed
                                 |    counter.

         ~ ~ ~ ~ ~ ~ ~

|<---------Heartbeat-------------|    Modem sends heartbeat signal
|
|                                     Router resets heartbeats missed
|                                     counter.

         ~ ~ ~ ~ ~ ~ ~

|<---------[Any signal]----------|    When the Router receives any
|                                     signal from the Modem.
|
|                                     Modem resets heartbeats missed
|                                     counter.

A.9.  Router Detects a Heartbeat timeout

Router                       Modem    Signal Description
========================================================================

        ||<----------------------|    Router misses a heartbeat


|       ||<----------------------|    Router misses too many heartbeats
|
|
|-------Peer Termination-------->|    Router sends Peer Termination
|                                     signal with 'Timeout' Status
|                                     data item.
:
:                                     Termination proceeds as above.




Ratliff, et al.         Expires October 15, 2015               [Page 60]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


A.10.  Modem Detects a Heartbeat timeout

Router                       Modem    Signal Description
========================================================================

|---------------------->||            Modem misses a heartbeat


|---------------------->||       |    Modem misses too many heartbeats
                                 |
                                 |
|<-------Peer Termination--------|    Modem sends Peer Termination
                                 |    signal with 'Timeout' Status
                                 |    data item.
                                 :
                                 :    Termination proceeds as above.

Appendix B.  Destination Specific Signal Flows

B.1.  Common Destination Signaling

Router                       Modem    Signal Description
========================================================================

                                 |    Modem detects a new logical
                                 |    destination is reachable, and
|<-------Destination Up----------|    sends Destination Up signal.
|
|--------Destination Up ACK----->|    Router sends Destination Up ACK.

           ~ ~ ~ ~ ~ ~ ~
                                 |    Modem detects change in logical
                                 |    destination metrics, and sends
|<-------Destination Update------|    Destination Update signal.

           ~ ~ ~ ~ ~ ~ ~
                                 |    Modem detects change in logical
                                 |    destination metrics, and sends
|<-------Destination Update------|    Destination Update signal.

            ~ ~ ~ ~ ~ ~ ~
                                 |    Modem detects logical destination
                                 |    is no longer reachable, and sends
|<-------Destination Down--------|    Destination Down signal.
|
|                                     Router receives Destination Down,
|                                     updates internal state, and sends
|--------Destination Down ACK--->|    Destination Down ACK signal.



Ratliff, et al.         Expires October 15, 2015               [Page 61]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


B.2.  Multicast Destination Signaling

Router                       Modem    Signal Description
========================================================================

|                                     Router detects a new multicast
|                                     destination is in use, and sends
|--------Destination Up--------->|    Destination Up signal.
                                 |
                                 |    Modem updates internal state to
                                 |    monitor multicast destination, and
|<-------Destination Up ACK------|    sends Destination Up ACK.

           ~ ~ ~ ~ ~ ~ ~
                                 |    Modem detects change in multicast
                                 |    destination metrics, and sends
|<-------Destination Update------|    Destination Update signal.

           ~ ~ ~ ~ ~ ~ ~
                                 |    Modem detects change in multicast
                                 |    destination metrics, and sends
|<-------Destination Update------|    Destination Update signal.

            ~ ~ ~ ~ ~ ~ ~
|                                     Router detects multicast
|                                     destination is no longer in use,
|--------Destination Down------->|    and sends Destination Down signal.
                                 |
                                 |    Modem receives Destination Down,
                                 |    updates internal state, and sends
|<-------Destination Down ACK----|    Destination Down ACK signal.

B.3.  Link Characteristics Request


















Ratliff, et al.         Expires October 15, 2015               [Page 62]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


Router                       Modem    Signal Description
========================================================================

                                      Destination has already been
           ~ ~ ~ ~ ~ ~ ~              announced by either peer.

|                                     Router requires different
|                                     Characteristics for the
|                                     destination, and sends Link
|--Link Characteristics Request->|    Characteristics Request signal.
                                 |
                                 |    Modem attempts to adjust link
                                 |    status to meet the received
                                 |    request, and sends a Link
                                 |    Characteristics Request ACK
|<---Link Char. Request ACK------|    signal with the new values.

Authors' Addresses

   Stan Ratliff
   VT iDirect
   13861 Sunrise Valley Drive, Suite 300
   Herndon, VA  20171
   USA

   Email: sratliff@idirect.net


   Bo Berry


   Shawn Jury
   Cisco Systems
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: sjury@cisco.com


   Darryl Satterwhite
   Broadcom

   Email: dsatterw@broadcom.com







Ratliff, et al.         Expires October 15, 2015               [Page 63]

Internet-Draft    Dynamic Link Exchange Protocol (DLEP)       April 2015


   Rick Taylor
   Airbus Defence & Space
   Quadrant House
   Celtic Springs
   Coedkernew
   Newport  NP10 8FZ
   UK

   Email: rick.taylor@airbus.com










































Ratliff, et al.         Expires October 15, 2015               [Page 64]
